In [192]:
import pandas as pd

# Intro to DataFrames

In [193]:
# Create a DataFrame
df = pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]], columns=['A', 'B', 'C'])
df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [194]:
# Display the first two rows of the DataFrame
df.head(2)

   A  B  C
0  1  2  3
1  4  5  6

In [195]:
# Display the last two rows of the DataFrame
df.tail(2)

   A  B  C
1  4  5  6
2  7  8  9

In [196]:
# Get DataFrame information
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
 2   C       3 non-null      int64
dtypes: int64(3)
memory usage: 204.0 bytes

In [197]:
df.describe()

         A    B    C
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

In [198]:
# Get the different unique values in column 'A'
df['A'].unique()

array([1, 4, 7])

In [199]:
# Get the shape of the DataFrame
df.shape

(3, 3)

# Warm-up data-set analysis

In [200]:
coffee_file_path = r'./warm-up_data/coffee.csv'

In [201]:
coffee_df = pd.read_csv(coffee_file_path)
coffee_df.head(10)

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35
5  Wednesday       Latte          25
6   Thursday    Espresso          40
7   Thursday       Latte          30
8     Friday    Espresso          45
9     Friday       Latte          35

##  Accessing DataFrame elements using .loc and .iloc

In [202]:
# Using .loc to access by label
coffee_df.loc[0] # Access the first row by label

Day              Monday
Coffee Type    Espresso
Units Sold           25
Name: 0, dtype: object

In [203]:
coffee_df.loc[0:3] # Access the first four rows by label

       Day Coffee Type  Units Sold
0   Monday    Espresso          25
1   Monday       Latte          15
2  Tuesday    Espresso          30
3  Tuesday       Latte          20

In [204]:
coffee_df.loc[0:3, ['Day', 'Units Sold']]

       Day  Units Sold
0   Monday          25
1   Monday          15
2  Tuesday          30
3  Tuesday          20

In [205]:
coffee_df.loc[:, ['Day', 'Units Sold']]

          Day  Units Sold
0      Monday          25
1      Monday          15
2     Tuesday          30
3     Tuesday          20
4   Wednesday          35
5   Wednesday          25
6    Thursday          40
7    Thursday          30
8      Friday          45
9      Friday          35
10   Saturday          45
11   Saturday          35
12     Sunday          45
13     Sunday          35

In [206]:
# Using .iloc to access by index
coffee_df.iloc[:, [0, 2]]

          Day  Units Sold
0      Monday          25
1      Monday          15
2     Tuesday          30
3     Tuesday          20
4   Wednesday          35
5   Wednesday          25
6    Thursday          40
7    Thursday          30
8      Friday          45
9      Friday          35
10   Saturday          45
11   Saturday          35
12     Sunday          45
13     Sunday          35

In [207]:
# Something interesting here is that both loc and iloc they are using the indexing in the Dataframe, what it means that if we are changing the index for names we need to access the data differently. For example: 
coffee_df.index = coffee_df['Day']
coffee_df

                 Day Coffee Type  Units Sold
Day
Monday        Monday    Espresso          25
Monday        Monday       Latte          15
Tuesday      Tuesday    Espresso          30
Tuesday      Tuesday       Latte          20
Wednesday  Wednesday    Espresso          35
Wednesday  Wednesday       Latte          25
Thursday    Thursday    Espresso          40
Thursday    Thursday       Latte          30
Friday        Friday    Espresso          45
Friday        Friday       Latte          35
Saturday    Saturday    Espresso          45
Saturday    Saturday       Latte          35
Sunday        Sunday    Espresso          45
Sunday        Sunday       Latte          35

In [208]:
coffee_df.loc["Monday":"Thursday", ['Day', 'Units Sold']]

                 Day  Units Sold
Day
Monday        Monday          25
Monday        Monday          15
Tuesday      Tuesday          30
Tuesday      Tuesday          20
Wednesday  Wednesday          35
Wednesday  Wednesday          25
Thursday    Thursday          40
Thursday    Thursday          30

In [209]:
coffee_df.index = range(len(coffee_df))

# Changing a specific cell value
coffee_df.loc[2, 'Units Sold'] = 10
coffee_df.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          10
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [210]:
#Sorting values
coffee_df.sort_values(by='Units Sold', ascending=False)

          Day Coffee Type  Units Sold
10   Saturday    Espresso          45
8      Friday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
4   Wednesday    Espresso          35
11   Saturday       Latte          35
13     Sunday       Latte          35
9      Friday       Latte          35
7    Thursday       Latte          30
0      Monday    Espresso          25
5   Wednesday       Latte          25
3     Tuesday       Latte          20
1      Monday       Latte          15
2     Tuesday    Espresso          10

In [211]:
# Iterating through rows
for index, row in coffee_df.iterrows():
    print(index)
    print(row)
    print('\n\n')

0
Day              Monday
Coffee Type    Espresso
Units Sold           25
Name: 0, dtype: object



1
Day            Monday
Coffee Type     Latte
Units Sold         15
Name: 1, dtype: object



2
Day             Tuesday
Coffee Type    Espresso
Units Sold           10
Name: 2, dtype: object



3
Day            Tuesday
Coffee Type      Latte
Units Sold          20
Name: 3, dtype: object



4
Day            Wednesday
Coffee Type     Espresso
Units Sold            35
Name: 4, dtype: object



5
Day            Wednesday
Coffee Type        Latte
Units Sold            25
Name: 5, dtype: object



6
Day            Thursday
Coffee Type    Espresso
Units Sold           40
Name: 6, dtype: object



7
Day            Thursday
Coffee Type       Latte
Units Sold           30
Name: 7, dtype: object



8
Day              Friday
Coffee Type    Espresso
Units Sold           45
Name: 8, dtype: object



9
Day            Friday
Coffee Type     Latte
Units Sold         35
Name: 9, dtype: object



10
Day            Saturday
Coffee Type    Espresso
Units Sold           45
Name: 10, dtype: object



11
Day            Saturday
Coffee Type       Latte
Units Sold           35
Name: 11, dtype: object



12
Day              Sunday
Coffee Type    Espresso
Units Sold           45
Name: 12, dtype: object



13
Day            Sunday
Coffee Type     Latte
Units Sold         35
Name: 13, dtype: object

# Real dataset analysis

## Importing datasets

In [212]:
bios_df = pd.read_csv(r'./data/bios.csv')
results_df = pd.read_csv(r'./data/results.csv')
olympics_df = pd.read_excel(r'./data/olympics-data.xlsx')

In [213]:
bios_df.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

## Filtering Data

In [214]:
bios_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   athlete_id    145500 non-null  int64
 1   name          145500 non-null  object
 2   born_date     143693 non-null  object
 3   born_city     110908 non-null  object
 4   born_region   110908 non-null  object
 5   born_country  110908 non-null  object
 6   NOC           145499 non-null  object
 7   height_cm     106651 non-null  float64
 8   weight_kg     102070 non-null  float64
 9   died_date     33940 non-null   object
dtypes: float64(2), int64(1), object(7)
memory usage: 11.1+ MB

In [215]:
# Filtering tallest athletes from USA
bios_df.loc[(bios_df['height_cm']>215) & (bios_df['born_country'] == 'USA'), ['name', 'height_cm']]

                    name  height_cm
5781      Tommy Burleson      223.0
6722    Shaquille O'Neal      216.0
6937      David Robinson      216.0
123850    Tyson Chandler      216.0

In [216]:
# Filtering buy some string inside the name (Regular Expression)
bios_df.loc[bios_df['name'].str.contains('Daniel')]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
22,23,Daniel Lawton,1881-11-27,Cantenac,Gironde,FRA,France,NaN,NaN,1979-03-27
184,185,Daniel Tsiokas,1971-06-19,Cluj-Napoca,Cluj,ROU,Greece,180.0,68.0,NaN
370,371,Daniel Desnoyers,1957-02-27,Québec City,Québec,CAN,Canada,187.0,90.0,NaN
716,720,Daniela Gergelcheva,1964-05-20,Momchilgrad,Kardzhali,BUL,Bulgaria,162.0,48.0,NaN
753,757,Daniel Nestor,1972-09-04,Beograd (Belgrade),Beograd,SRB,Canada,191.0,87.0,NaN
...,...,...,...,...,...,...,...,...,...,...
144792,148493,Daniel Grassl,2002-04-04,Merano,Bolzano-Bozen,ITA,Italy,175.0,NaN,NaN
144799,148500,Daniele Bagozza,1995-07-03,Bressanone,Bolzano-Bozen,ITA,Italy,NaN,NaN,NaN
145163,148880,Daniel Andrei Cacina,2001-10-17,Brașov,Brașov,ROU,Romania,190.0,NaN,NaN
145279,149000,Daniel Magnusson,2000-03-08,Karlstad,Värmland,SWE,Sweden,NaN,NaN,NaN
145297,149019,Daniel Brodin,1990-02-09,Tyresö,Stockholm,SWE,Sweden,NaN,NaN,NaN

In [217]:
bios_df.loc[bios_df['name'].str.contains('Daniel', case=False)] # Case insensitive search, what it means that doesn't matter if is upper or lower case

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
22,23,Daniel Lawton,1881-11-27,Cantenac,Gironde,FRA,France,NaN,NaN,1979-03-27
184,185,Daniel Tsiokas,1971-06-19,Cluj-Napoca,Cluj,ROU,Greece,180.0,68.0,NaN
370,371,Daniel Desnoyers,1957-02-27,Québec City,Québec,CAN,Canada,187.0,90.0,NaN
716,720,Daniela Gergelcheva,1964-05-20,Momchilgrad,Kardzhali,BUL,Bulgaria,162.0,48.0,NaN
753,757,Daniel Nestor,1972-09-04,Beograd (Belgrade),Beograd,SRB,Canada,191.0,87.0,NaN
...,...,...,...,...,...,...,...,...,...,...
144792,148493,Daniel Grassl,2002-04-04,Merano,Bolzano-Bozen,ITA,Italy,175.0,NaN,NaN
144799,148500,Daniele Bagozza,1995-07-03,Bressanone,Bolzano-Bozen,ITA,Italy,NaN,NaN,NaN
145163,148880,Daniel Andrei Cacina,2001-10-17,Brașov,Brașov,ROU,Romania,190.0,NaN,NaN
145279,149000,Daniel Magnusson,2000-03-08,Karlstad,Värmland,SWE,Sweden,NaN,NaN,NaN
145297,149019,Daniel Brodin,1990-02-09,Tyresö,Stockholm,SWE,Sweden,NaN,NaN,NaN

In [218]:
bios_df.loc[bios_df['name'].str.contains('Daniel|keith', case=False)]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
22,23,Daniel Lawton,1881-11-27,Cantenac,Gironde,FRA,France,NaN,NaN,1979-03-27
184,185,Daniel Tsiokas,1971-06-19,Cluj-Napoca,Cluj,ROU,Greece,180.0,68.0,NaN
370,371,Daniel Desnoyers,1957-02-27,Québec City,Québec,CAN,Canada,187.0,90.0,NaN
716,720,Daniela Gergelcheva,1964-05-20,Momchilgrad,Kardzhali,BUL,Bulgaria,162.0,48.0,NaN
753,757,Daniel Nestor,1972-09-04,Beograd (Belgrade),Beograd,SRB,Canada,191.0,87.0,NaN
...,...,...,...,...,...,...,...,...,...,...
144792,148493,Daniel Grassl,2002-04-04,Merano,Bolzano-Bozen,ITA,Italy,175.0,NaN,NaN
144799,148500,Daniele Bagozza,1995-07-03,Bressanone,Bolzano-Bozen,ITA,Italy,NaN,NaN,NaN
145163,148880,Daniel Andrei Cacina,2001-10-17,Brașov,Brașov,ROU,Romania,190.0,NaN,NaN
145279,149000,Daniel Magnusson,2000-03-08,Karlstad,Värmland,SWE,Sweden,NaN,NaN,NaN
145297,149019,Daniel Brodin,1990-02-09,Tyresö,Stockholm,SWE,Sweden,NaN,NaN,NaN

In [219]:
bios_df.loc[(bios_df['born_country'].isin(['CUB', 'FRA'])) & (bios_df['name'].str.contains('Mijaín'))]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
106500,107601,Mijaín López,1982-08-20,Consolación del Sur,Pinar del Río,CUB,Cuba,198.0,130.0,NaN

In [220]:
# Query method
bios_df.query("height_cm > 215 and born_country == 'USA'")

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
5781,5804,Tommy Burleson,1952-02-24,Crossnore,North Carolina,USA,United States,223.0,102.0,NaN
6722,6755,Shaquille O'Neal,1972-03-06,Newark,New Jersey,USA,United States,216.0,137.0,NaN
6937,6972,David Robinson,1965-08-06,Key West,Florida,USA,United States,216.0,107.0,NaN
123850,126093,Tyson Chandler,1982-10-02,Hanford,California,USA,United States,216.0,107.0,NaN

## Adding/Removing columns

In [221]:
coffee_df.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          10
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [222]:
coffee_df['price'] = 4.99
coffee_df

          Day Coffee Type  Units Sold  price
0      Monday    Espresso          25   4.99
1      Monday       Latte          15   4.99
2     Tuesday    Espresso          10   4.99
3     Tuesday       Latte          20   4.99
4   Wednesday    Espresso          35   4.99
5   Wednesday       Latte          25   4.99
6    Thursday    Espresso          40   4.99
7    Thursday       Latte          30   4.99
8      Friday    Espresso          45   4.99
9      Friday       Latte          35   4.99
10   Saturday    Espresso          45   4.99
11   Saturday       Latte          35   4.99
12     Sunday    Espresso          45   4.99
13     Sunday       Latte          35   4.99

In [223]:
import numpy as np
coffee_df['new_price'] = np.where(coffee_df["Coffee Type"] == 'Espresso', 5.99, 4.99)
coffee_df

          Day Coffee Type  Units Sold  price  new_price
0      Monday    Espresso          25   4.99       5.99
1      Monday       Latte          15   4.99       4.99
2     Tuesday    Espresso          10   4.99       5.99
3     Tuesday       Latte          20   4.99       4.99
4   Wednesday    Espresso          35   4.99       5.99
5   Wednesday       Latte          25   4.99       4.99
6    Thursday    Espresso          40   4.99       5.99
7    Thursday       Latte          30   4.99       4.99
8      Friday    Espresso          45   4.99       5.99
9      Friday       Latte          35   4.99       4.99
10   Saturday    Espresso          45   4.99       5.99
11   Saturday       Latte          35   4.99       4.99
12     Sunday    Espresso          45   4.99       5.99
13     Sunday       Latte          35   4.99       4.99

In [224]:
coffee_df.drop(columns=['price'], inplace=True)
coffee_df

          Day Coffee Type  Units Sold  new_price
0      Monday    Espresso          25       5.99
1      Monday       Latte          15       4.99
2     Tuesday    Espresso          10       5.99
3     Tuesday       Latte          20       4.99
4   Wednesday    Espresso          35       5.99
5   Wednesday       Latte          25       4.99
6    Thursday    Espresso          40       5.99
7    Thursday       Latte          30       4.99
8      Friday    Espresso          45       5.99
9      Friday       Latte          35       4.99
10   Saturday    Espresso          45       5.99
11   Saturday       Latte          35       4.99
12     Sunday    Espresso          45       5.99
13     Sunday       Latte          35       4.99

In [225]:
# If you want to create a copy of the dataframe before making changes
coffee_df_new = coffee_df.copy()
# Because if you just do:
# coffee_df_new = coffee_df
# any changes made to coffee_df_new will also affect coffee_df, because they are both pointing to the same space in memory.

In [226]:
coffee_df['revenue'] = coffee_df['Units Sold'] * coffee_df['new_price']
coffee_df

          Day Coffee Type  Units Sold  new_price  revenue
0      Monday    Espresso          25       5.99   149.75
1      Monday       Latte          15       4.99    74.85
2     Tuesday    Espresso          10       5.99    59.90
3     Tuesday       Latte          20       4.99    99.80
4   Wednesday    Espresso          35       5.99   209.65
5   Wednesday       Latte          25       4.99   124.75
6    Thursday    Espresso          40       5.99   239.60
7    Thursday       Latte          30       4.99   149.70
8      Friday    Espresso          45       5.99   269.55
9      Friday       Latte          35       4.99   174.65
10   Saturday    Espresso          45       5.99   269.55
11   Saturday       Latte          35       4.99   174.65
12     Sunday    Espresso          45       5.99   269.55
13     Sunday       Latte          35       4.99   174.65

In [227]:
coffee_df.sort_values(by='revenue', ascending=False)

          Day Coffee Type  Units Sold  new_price  revenue
10   Saturday    Espresso          45       5.99   269.55
8      Friday    Espresso          45       5.99   269.55
12     Sunday    Espresso          45       5.99   269.55
6    Thursday    Espresso          40       5.99   239.60
4   Wednesday    Espresso          35       5.99   209.65
11   Saturday       Latte          35       4.99   174.65
13     Sunday       Latte          35       4.99   174.65
9      Friday       Latte          35       4.99   174.65
0      Monday    Espresso          25       5.99   149.75
7    Thursday       Latte          30       4.99   149.70
5   Wednesday       Latte          25       4.99   124.75
3     Tuesday       Latte          20       4.99    99.80
1      Monday       Latte          15       4.99    74.85
2     Tuesday    Espresso          10       5.99    59.90

In [228]:
coffee_df.rename(columns={'new_price':'price'}, inplace=True)
coffee_df

          Day Coffee Type  Units Sold  price  revenue
0      Monday    Espresso          25   5.99   149.75
1      Monday       Latte          15   4.99    74.85
2     Tuesday    Espresso          10   5.99    59.90
3     Tuesday       Latte          20   4.99    99.80
4   Wednesday    Espresso          35   5.99   209.65
5   Wednesday       Latte          25   4.99   124.75
6    Thursday    Espresso          40   5.99   239.60
7    Thursday       Latte          30   4.99   149.70
8      Friday    Espresso          45   5.99   269.55
9      Friday       Latte          35   4.99   174.65
10   Saturday    Espresso          45   5.99   269.55
11   Saturday       Latte          35   4.99   174.65
12     Sunday    Espresso          45   5.99   269.55
13     Sunday       Latte          35   4.99   174.65

## Getting specific info from columns

In [229]:
bios_df

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25
...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20

In [230]:
bios_df_new = bios_df.copy()

In [231]:
bios_df_new['first_name'] = bios_df_new['name'].str.split().str[0]
bios_df_new

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-François
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert
...,...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN,Polina
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN,Valeriya
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN,Yuliya
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18,André
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20,Bill

In [232]:
bios_df_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 11 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   athlete_id    145500 non-null  int64
 1   name          145500 non-null  object
 2   born_date     143693 non-null  object
 3   born_city     110908 non-null  object
 4   born_region   110908 non-null  object
 5   born_country  110908 non-null  object
 6   NOC           145499 non-null  object
 7   height_cm     106651 non-null  float64
 8   weight_kg     102070 non-null  float64
 9   died_date     33940 non-null   object
 10  first_name    145500 non-null  object
dtypes: float64(2), int64(1), object(8)
memory usage: 12.2+ MB

In [233]:
bios_df_new['born_datetime'] = pd.to_datetime(bios_df_new['born_date'])
bios_df_new['born_year'] = bios_df_new['born_datetime'].dt.year
bios_df_new['born_month'] = bios_df_new['born_datetime'].dt.month
bios_df_new.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name,born_datetime,born_year,born_month
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-François,1886-12-12,1886.0,12.0
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud,1969-04-01,1969.0,4.0
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean,1898-08-13,1898.0,8.0
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques,1895-05-11,1895.0,5.0
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert,1878-04-17,1878.0,4.0

In [234]:
bios_df_new = bios_df_new.drop(columns=['born_date'])
bios_df_new

,athlete_id,name,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name,born_datetime,born_year,born_month
0,1,Jean-François Blanchy,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-François,1886-12-12,1886.0,12.0
1,2,Arnaud Boetsch,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud,1969-04-01,1969.0,4.0
2,3,Jean Borotra,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean,1898-08-13,1898.0,8.0
3,4,Jacques Brugnon,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques,1895-05-11,1895.0,5.0
4,5,Albert Canet,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert,1878-04-17,1878.0,4.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN,Polina,2002-01-30,2002.0,1.0
145496,149223,Valeriya Merkusheva,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN,Valeriya,1999-09-20,1999.0,9.0
145497,149224,Yuliya Smirnova,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN,Yuliya,1998-05-08,1998.0,5.0
145498,149225,André Foussard,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18,André,1899-05-19,1899.0,5.0
145499,149814,Bill Phillips,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20,Bill,1913-07-15,1913.0,7.0

In [235]:
bios_df_new.to_csv(r'./data/bios_modified.csv', index=False)

In [236]:
bios_df['height_category'] = bios_df['height_cm'].apply(lambda x: 'Tall' if x > 180 else ('Average' if x >= 160 else 'Short'))
bios_df

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Short
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Tall
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Tall
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Average
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Short
...,...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN,Average
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN,Average
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN,Average
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18,Average
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20,Short

## Cool functions using with the apply method

In [237]:
def categorize_athlete(row):
    if row['height_cm'] > 180 and row['weight_kg'] > 80:
        return 'Heavyweight'
    elif row['height_cm'] < 180 or row['weight_kg'] <= 80:
        return 'Lightweight'
    else:
        return 'Average_weight'

bios_df['athlete_category'] = bios_df.apply(categorize_athlete, axis=1) # Axis = 1 means we are applying the function to each row (Axis = 0 would be for columns)

In [238]:
bios_df.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category,athlete_category
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Short,Average_weight
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Tall,Lightweight
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Tall,Lightweight
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Average,Lightweight
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Short,Average_weight

# Merging and Concatenating data

In [239]:
nocs = pd.read_csv(r'./data/noc_regions.csv')
nocs.head()

   NOC       region                 notes
0  AFG  Afghanistan                   NaN
1  AHO      Curacao  Netherlands Antilles
2  ALB      Albania                   NaN
3  ALG      Algeria                   NaN
4  AND      Andorra                   NaN

In [240]:
bios = pd.merge(bios_df, nocs, left_on='born_country', right_on='NOC', how='left')
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC_x,height_cm,weight_kg,died_date,height_category,athlete_category,NOC_y,region,notes
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Short,Average_weight,FRA,France,NaN
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Tall,Lightweight,FRA,France,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Tall,Lightweight,FRA,France,NaN
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Average,Lightweight,FRA,France,NaN
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Short,Average_weight,GBR,UK,NaN

In [241]:
bios.rename(columns={'region':'born_country_full'}, inplace=True)
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC_x,height_cm,weight_kg,died_date,height_category,athlete_category,NOC_y,born_country_full,notes
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Short,Average_weight,FRA,France,NaN
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Tall,Lightweight,FRA,France,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Tall,Lightweight,FRA,France,NaN
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Average,Lightweight,FRA,France,NaN
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Short,Average_weight,GBR,UK,NaN

In [242]:
bios[bios['NOC_x'] != bios['born_country_full']][['NOC_x', 'born_country_full']]

          NOC_x born_country_full
4        France                UK
12       France               NaN
13       France               NaN
16       France           Morocco
27       France               NaN
...         ...               ...
145491  Jamaica               NaN
145493      ROC            Russia
145495      ROC            Russia
145496      ROC            Russia
145497      ROC            Russia

[73210 rows x 2 columns]

In [243]:
cuba = bios[bios['born_country'] == 'CUB'].copy()
france = bios[bios['born_country'] == 'FRA'].copy()
cuba.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC_x,height_cm,weight_kg,died_date,height_category,athlete_category,NOC_y,born_country_full,notes
1479,1486,Omar Ajete,1965-01-31,San Juan y Martínez,Pinar del Río,CUB,Cuba,175.0,93.0,NaN,Average,Lightweight,CUB,Cuba,NaN
1480,1487,Rolando Arrojo,1965-07-18,San Juan de los Yeras,Villa Clara,CUB,Cuba,193.0,100.0,NaN,Tall,Heavyweight,CUB,Cuba,NaN
1481,1488,Miguel Caldés,1970-09-27,Bolivia,Ciego de Ávila,CUB,Cuba,185.0,85.0,2000-12-04,Tall,Heavyweight,CUB,Cuba,NaN
1482,1489,José Contreras,1971-12-06,Las Martinas,Pinar del Río,CUB,Cuba,191.0,107.0,NaN,Tall,Heavyweight,CUB,Cuba,NaN
1483,1490,José Delgado,1960-08-25,Meneses,Sancti Spíritus,CUB,Cuba,182.0,85.0,NaN,Tall,Heavyweight,CUB,Cuba,NaN

In [244]:
cub_fra_df = pd.concat([cuba, france], ignore_index=True)
cub_fra_df

,athlete_id,name,born_date,born_city,born_region,born_country,NOC_x,height_cm,weight_kg,died_date,height_category,athlete_category,NOC_y,born_country_full,notes
0,1486,Omar Ajete,1965-01-31,San Juan y Martínez,Pinar del Río,CUB,Cuba,175.0,93.0,NaN,Average,Lightweight,CUB,Cuba,NaN
1,1487,Rolando Arrojo,1965-07-18,San Juan de los Yeras,Villa Clara,CUB,Cuba,193.0,100.0,NaN,Tall,Heavyweight,CUB,Cuba,NaN
2,1488,Miguel Caldés,1970-09-27,Bolivia,Ciego de Ávila,CUB,Cuba,185.0,85.0,2000-12-04,Tall,Heavyweight,CUB,Cuba,NaN
3,1489,José Contreras,1971-12-06,Las Martinas,Pinar del Río,CUB,Cuba,191.0,107.0,NaN,Tall,Heavyweight,CUB,Cuba,NaN
4,1490,José Delgado,1960-08-25,Meneses,Sancti Spíritus,CUB,Cuba,182.0,85.0,NaN,Tall,Heavyweight,CUB,Cuba,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6130,148348,James Clugnet,1996-12-04,Grenoble,Isère,FRA,Great Britain,NaN,NaN,NaN,Short,Average_weight,FRA,France,NaN
6131,148720,Margaux Hackett,1999-06-02,Annecy,Haute-Savoie,FRA,New Zealand,NaN,NaN,NaN,Short,Average_weight,FRA,France,NaN
6132,149002,Elliott Baralo,1998-08-01,Annecy,Haute-Savoie,FRA,Sweden,NaN,NaN,NaN,Short,Average_weight,FRA,France,NaN
6133,149194,Elisa Nakab,1998-05-08,Briançon,Hautes-Alpes,FRA,Italy,NaN,NaN,NaN,Short,Average_weight,FRA,France,NaN
6134,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18,Average,Lightweight,FRA,France,NaN

In [245]:
cub_fra_df.drop(columns=['notes'], inplace=True)

In [246]:
cub_fra_df.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC_x,height_cm,weight_kg,died_date,height_category,athlete_category,NOC_y,born_country_full
0,1486,Omar Ajete,1965-01-31,San Juan y Martínez,Pinar del Río,CUB,Cuba,175.0,93.0,NaN,Average,Lightweight,CUB,Cuba
1,1487,Rolando Arrojo,1965-07-18,San Juan de los Yeras,Villa Clara,CUB,Cuba,193.0,100.0,NaN,Tall,Heavyweight,CUB,Cuba
2,1488,Miguel Caldés,1970-09-27,Bolivia,Ciego de Ávila,CUB,Cuba,185.0,85.0,2000-12-04,Tall,Heavyweight,CUB,Cuba
3,1489,José Contreras,1971-12-06,Las Martinas,Pinar del Río,CUB,Cuba,191.0,107.0,NaN,Tall,Heavyweight,CUB,Cuba
4,1490,José Delgado,1960-08-25,Meneses,Sancti Spíritus,CUB,Cuba,182.0,85.0,NaN,Tall,Heavyweight,CUB,Cuba

In [247]:
cub_fra_df.tail()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC_x,height_cm,weight_kg,died_date,height_category,athlete_category,NOC_y,born_country_full
6130,148348,James Clugnet,1996-12-04,Grenoble,Isère,FRA,Great Britain,NaN,NaN,NaN,Short,Average_weight,FRA,France
6131,148720,Margaux Hackett,1999-06-02,Annecy,Haute-Savoie,FRA,New Zealand,NaN,NaN,NaN,Short,Average_weight,FRA,France
6132,149002,Elliott Baralo,1998-08-01,Annecy,Haute-Savoie,FRA,Sweden,NaN,NaN,NaN,Short,Average_weight,FRA,France
6133,149194,Elisa Nakab,1998-05-08,Briançon,Hautes-Alpes,FRA,Italy,NaN,NaN,NaN,Short,Average_weight,FRA,France
6134,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18,Average,Lightweight,FRA,France

In [248]:
results_df.head()

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,NaN,17.0,True,NaN
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jean Montariol,NaN,False,NaN
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,NaN,32.0,True,NaN
3,1920.0,Summer,Tennis,"Doubles, Mixed (Olympic)",Jean-François Blanchy,1,FRA,Jeanne Vaussard,8.0,True,NaN
4,1920.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jacques Brugnon,4.0,False,NaN

In [249]:
combine_df= pd.merge(results_df, bios, on='athlete_id', how='left')
combine_df.tail()

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,...,born_country,NOC_x,height_cm,weight_kg,died_date,height_category,athlete_category,NOC_y,born_country_full,notes
308403,2022.0,Winter,Luge,"Singles, Men (Olympic)",Marián Skupek,148983,SVK,NaN,26.0,False,...,SVK,Slovakia,196.0,108.0,NaN,Tall,Heavyweight,SVK,Slovakia,NaN
308404,2022.0,Winter,Alpine Skiing (Skiing),"Slalom, Women (Olympic)",Elsa Fermbäck,148984,SWE,NaN,28.0,False,...,SWE,Sweden,NaN,NaN,NaN,Short,Average_weight,SWE,Sweden,NaN
308405,2022.0,Winter,Alpine Skiing (Skiing),"Team, Mixed (Olympic)",Hilma Lövblom,148985,SWE,Sweden,13.0,False,...,SWE,Sweden,NaN,NaN,NaN,Short,Average_weight,SWE,Sweden,NaN
308406,2022.0,Winter,Alpine Skiing (Skiing),"Giant Slalom, Women (Olympic)",Hilma Lövblom,148985,SWE,NaN,NaN,False,...,SWE,Sweden,NaN,NaN,NaN,Short,Average_weight,SWE,Sweden,NaN
308407,2022.0,Winter,NaN,"Slalom, Women (Olympic)",Charlotta Säfvenberg,148986,NaN,NaN,24.0,False,...,SWE,Sweden,NaN,NaN,NaN,Short,Average_weight,SWE,Sweden,NaN

# Handling Null Values in a dataset

In [250]:
coffee_df.loc[[0,1], 'Units Sold'] = np.nan

In [251]:
coffee_df.head()

         Day Coffee Type  Units Sold  price  revenue
0     Monday    Espresso         NaN   5.99   149.75
1     Monday       Latte         NaN   4.99    74.85
2    Tuesday    Espresso        10.0   5.99    59.90
3    Tuesday       Latte        20.0   4.99    99.80
4  Wednesday    Espresso        35.0   5.99   209.65

In [252]:
coffee_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Day          14 non-null     object
 1   Coffee Type  14 non-null     object
 2   Units Sold   12 non-null     float64
 3   price        14 non-null     float64
 4   revenue      14 non-null     float64
dtypes: float64(3), object(2)
memory usage: 692.0+ bytes

In [253]:
#coffee_df = coffee_df.fillna(coffee_df['Units Sold'].mean()) # There is another ways, one of them is using interpolate function, that is finding a pattern and filling the null values based on that pattern.

In [254]:
#coffee_df.dropna(inplace=True) # Remove rows with null values

In [255]:
coffee_df[coffee_df['Units Sold'].isna()] #Also we can use notna() to find non null values

      Day Coffee Type  Units Sold  price  revenue
0  Monday    Espresso         NaN   5.99   149.75
1  Monday       Latte         NaN   4.99    74.85

# Aggregating data

In [256]:
bios['born_city'].value_counts()

born_city
Budapest           1378
Moskva (Moscow)     883
Oslo                708
Stockholm           629
Praha (Prague)      600
                   ...
Kirovgrad             1
Pereiaslav            1
Podgornyy             1
Kudepsta              1
Furmanov              1
Name: count, Length: 22368, dtype: int64

In [258]:
bios[bios['born_country'] == 'USA']['born_region'].value_counts()

born_region
California              1634
New York                 990
Illinois                 585
Massachusetts            530
Pennsylvania             530
New Jersey               381
Texas                    368
Minnesota                365
Ohio                     328
Michigan                 319
Washington               240
Florida                  235
Wisconsin                209
Colorado                 207
Connecticut              156
Indiana                  150
Oregon                   132
Georgia                  129
Virginia                 121
Maryland                 117
District of Columbia     107
Iowa                     102
Hawaiʻi                   95
Kansas                    94
Oklahoma                  93
Louisiana                 92
Utah                      91
Missouri                  91
North Carolina            86
Arizona                   83
New Hampshire             83
Vermont                   68
Mississippi               66
Alabama                   64
Kentucky                  62
Tennessee                 62
Nebraska                  60
Rhode Island              56
Montana                   55
Maine                     50
South Carolina            50
Alaska                    45
Arkansas                  42
Idaho                     41
New Mexico                38
Nevada                    36
South Dakota              27
West Virginia             24
Delaware                  22
North Dakota              16
Wyoming                   14
Name: count, dtype: int64